Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh44-45-v3.tmx
Source language: bo
Languages: en

source: དེས་དེ་ན་རྒྱལ་པོ་མེས་བསྒོ་ཞིང་ལ་ལ་ནི་རྐ་ལག་གཅད། ལ་ལ་ནི་རྣ་བ་དང་སྣ་བཅད། ལ་ལ་ནི་མྱིག་ཕྱུང་། ལ་ལ་ནི་ཡན་ལག་དང་ཉིང་ལག་དང་། མགོ་བཅད།
en: Sudhana saw, according to King Anala’s commands, some having their hands and feet cut off, some their ears and noses cut off, some their eyes gouged out, and some their limbs and all the smaller parts of the bodies cut off.

source: ལ་ལ་ནི་ལུས་ཐམས་ཅད་མེས་བཏང་། ལ་ལ་ནི་བ་ཚྭའི་ཆུ་ཁོལ་མས་ལུས་ལ་གཏོར་ཅིང་པགས་པ་བརྙིལ་བ་ལ་སྩོགས་པ། དེ་ལྟ་བུའི་ཆད་པ་སྣ་ཚོགས་དུ་མ་མི་བཟད་པ་དྲག་པ་བརླང་བ་ཡིད་དུ་མི་འོང་བ་སྲོག་འཕྲོག་པ་དག་ཀྱང་བྱེད་པར་མཐོང་ངོ་། །གསད་པའི་ས་དེ་ན་འང་བསད་པའི་རྐ་ལག་དང་། རྣ་བ་དང་།
en: Some were decapitated, some were burned alive, some had their skin destroyed by boiling salt water being poured over their bodies, and there were various other punishments that were horrible, harsh, cruel, dreadful, and deadly.

source: མྱིག་དང་། སྣ་དང་། མགོ་དང་། ཡན་ལག་དང་། ཉིང་ལག་གི་ཕུང་པོ་རི་རབ་ཙམ་དུ་སྤུངས་པ་མཐོང་ངོ་། །
en: Sudhana saw that at the site of the executions there was a mound of the feet, hands, ears, eyes, noses, heads, limbs, and smaller parts of the bodies of those who had been executed that was as large as Sumeru.

source: ཁྲག་གི་མཚོ་དཔག་ཚད་གསུམ་ཙམ་དུ་ཟབས་སུ་ཟབ་ལ་ཆུ་ཞིང་དུ་དཔག་ཚད་དུ་མ་ཡོད་པ་ཡང་མཐོང་ངོ་། །
en: He saw a lake of blood that was three yojanas deep and many yojanas wide.

source: དེ་ན་ཤི་བའི་ཀེང་རུས་ཡན་ལག་དང་ཉིང་ལག་དང་། མགོ་དང་བྲལ་བ་བརྒྱ་སྟོང་དུ་མ་ལ།
en: He saw there many hundreds of thousands of the skeletons of the dead, missing their limbs, smaller parts, and heads.

source: སྤྱང་ཀི་དང་ཝ་དང་། ཁྱི་དང་བྱ་རོག་དང་། བྱ་རྒོད་དང་། ཁྲ་དང་བྱ་ཀུ་རར་མང་པོས་གང་སྟེ། འདྲད་ཅིང་འཐོག་པ་མཐོང་ངོ་། །དེ་ལའང་ལ་ལ་ནི་ཁ་དོག་གྱུར་ཏེ།
en: The place was filled with many wolves, jackals, dogs, ravens, vultures, buzzards, and eagles.

source: སྔོན་པོར་གྱུར་པ་ཙམ། ལ་ལ་ནི་རྣགས་པ་ཙམ། ལ་ལ་ནི་བམ་པ་ཙམ། ལ་ལ་ནི་འབུ་ཞུགས་པ་ཙམ་དུ་གྱུར་ཏེ། ཤིན་ཏུ་སྐྱི་གཡའ་ཞིང་འཇིགས་འཇིགས་ལྟར་འདུག་པ་མཐོང་ངོ་། །གསང་བ་དེ་དག་གསོད་པའི་ཚེ།
en: He saw that some bodies were darkened to black, some were rotting, some were bloated, and some were filled with maggots, loathsome and terrifying.

source: མྱི་སྡུག་པ་ཆོ་དགུར་བྱས་པས་ན་འཇིགས་འཇིགས་སྐད་དང་། སྙིང་རྡོ་རྗེ་སྐད་དུ་སྒྲ་འབྱིན་ཅིང་ཆོ་ངེས་འདེབས་པའི་སྒྲ་ཆེན་པོ་ཐོས་ན། སྐྱི་གཡའ་ཞིང་མི་དགའ་བ་ཆེན་པོ་བསྐྱེད་པ། སེམས་ཅན་དམྱལ་བ་ཆེན་པོ་རིས་གཞོམ་པའི་སྒྲ་ལྟ་བུའང་ཐོས་སོ། །དེས་དེ་ལྟར་ཁ་བཏགས་ཏེ་བརྡུངས་པ་དང་།
en: He heard the sounds of the loud, horrible screams of pain, the pitiful wailing being emitted by those being executed, being slain, and being slaughtered in various ways; the sounds of their horror and distress were like those of the beings in the great Saṃghāta hell.

source: ཤིན་ཏུ་འཇིགས་པའི་དྲག་ཤུལ་མཐོང་ནས། འདི་སྙམ་དུ་གྱུར་ཏེ་བདག་ནི་སེམས་ཅན་ཐམས་ཅད་ལ་ཕན་པ་དང་། བདེ་བའི་ཕྱིར་བླ་ན་མྱེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་ཞུགས་ཏེ།
en: When Sudhana saw this dreadful and terrifying violence, he thought, “I am set on the highest, complete enlightenment and am dedicated to seeking the bodhisattva conduct in order to benefit and bring happiness to all beings.

source: བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ཡོངས་སུ་ཚོལ་ཞིང་འབད་དེ། དགེ་བའི་བཤེས་གཉེན་རྣམས་ལ་དགེ་བ་ནི་ཅི་ཞིག་བགྱི།
en: The kalyāṇamitras always ask, ‘What good actions has a bodhisattva done?

source: མི་དགེ་བ་ནི་གང་ཞིག་སྤང་ཞེས་འདྲི་འདྲི་ན།
en: What bad actions have been avoided?’

source: རྒྱལ་པོ་མེ་འདི་ལ་ནི་དགེ་བའི་ཆོས་ཀྱང་མྱེད་དེ།
en: But this King Anala is devoid of the qualities of good actions.

source: ཁ་ན་མ་ཐོ་བ་ཆེན་པོའི་ལས་ལ་སྤྱོད་པ་ཡིད་ཀྱི་ཡོངས་སུ་རྟོག་པ་ཤིན་ཏུ་གཏུམ་པ་དང་ལྡན་པ།
en: He is engaged in great transgressive acts. He has wicked thoughts in his mind.

source: སེམས་ཅན་ཕ་རོལ་གྱི་སྲོག་གཅད་པ་ལ་ཞུགས་པ།
en: He is engaged in taking the lives of others.

source: སེམས་ཅན་ཕ་རོལ་ཤིན་ཏུ་མནར་བ་ལ་བརྩོན་པ།
en: He is dedicated to harming other beings.

source: ཚེ་ཕྱི་མ་ལ་ལྟ་བ་མྱེད་པ།
en: He has no concern for his next life.

source: ངན་སོང་གི་གཡང་སའི་གད་ཀ་ན་འདུག་པ་ཞིག་ན།
en: He is at the edge of the precipice of the lower realms.

source: འདི་ལས་ཅིག་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པའང་ཐོས་པར་འགྱུར་རམ་སྙམ་སྟེ།
en: What bodhisattva conduct could I hear from him?”

source: དེ་དེ་ལྟར་སེམས་ཤིང་ཡིད་ལ་བྱེད་དེ། སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་བསྐྱབ་པ་ལ་མངོན་པར་བརྩོན་པ། སྙིང་རྗེ་ཆེན་པོ་སྐྱེས་པའི་སེམས་དང་ལྡན་པ་དེ་ལ་སྟེང་གི་ནམ་མཁའི་དབྱིངས་ལས་ལྷ་མང་པོས་བོས་པ། རིགས་ཀྱི་བུ་དྲང་སྲོང་རྒྱལ་བའི་དྲོད་ཀྱི་སྐྱེ་མཆེད་ཀྱི་དགེ་བའི་བཤེས་གཉེན་གྱི་གདམས་ངག་ཏུ་བྱ་བ་མི་དྲན་ནམ།
en: While Sudhana, who was motivated to protect the entire realm of beings, whose mind had developed great compassion, was thinking and contemplating in that way, devas who were up in the sky above him addressed him in this way: “Noble one, do you not remember the instructions of the kalyāṇamitra ṛṣi Jayoṣmāyatana?”

source: དེས་གྱེན་དུ་ནམ་མཁའི་དབྱིངས་ལ་བལྟས་ནས། དྲན་ནོ་ཞེས་བརྗོད་དོ། །
en: Sudhana looked up into the realm of the sky and answered, “Yes, I remember.”

source: ལྷ་རྣམས་ཀྱིས་སྨྲས་པ། རིགས་ཀྱི་བུ་ཁྱོད་དགེ་བའི་བཤེས་གཉེན་གྱི་གདམས་ངག་ལ་དེ་ལྟར་ཐེ་ཚོམ་མ་བསྐྱེད་ཅིག །
en: The devas said, “Noble one, do not doubt in this way the instruction of the kalyāṇamitra!

source: རིགས་ཀྱི་བུ་དགེ་བའི་བཤེས་གཉེན་རྣམས་ནི་ཡང་དག་པ་མ་ནོར་བར་སྟོན་གྱི་ལོག་པ་མ་ཡིན་ནོ། །
en: Noble one, the kalyāṇamitras give correct guidance and never do so incorrectly.

source: རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ཐབས་མཁས་པས་སྤྱོད་པའི་ཡེ་ཤེས་ནི་བསམ་གྱིས་མི་ཁྱབ་བོ། །
en: Noble one, the wisdom of the bodhisattvas in practicing skillful methods is inconceivable.

source: སེམས་ཅན་ཡོངས་སུ་སྡུད་པའི་ཡེ་ཤེས་ནི་བསམ་གྱིས་མི་ཁྱབ་བོ། །
en: Their wisdom in gathering beings as pupils is inconceivable.

source: སེམས་ཅན་ལ་ཕན་འདོགས་པའི་ཡེ་ཤེས་བསམ་གྱིས་མི་ཁྱབ་བོ། །
en: Their wisdom in benefiting beings is inconceivable.

source: སེམས་ཅན་ཚར་གཅོད་པའི་ཡེ་ཤེས་བསམ་གྱིས་མི་ཁྱབ་བོ། །
en: Their wisdom in subjugating beings is inconceivable.

source: སེམས་ཅན་གཟེངས་བསྟོད་པའི་ཡེ་ཤེས་བསམ་གྱིས་མི་ཁྱབ་བོ། །
en: Their wisdom in inspiring beings is inconceivable.

source: སེམས་ཅན་ཡོངས་སུ་སྦྱོང་བའི་ཡེ་ཤེས་བསམ་གྱིས་མི་ཁྱབ་བོ། །
en: Their wisdom in purifying beings is inconceivable.

source: སེམས་ཅན་ཡོངས་སུ་སྐྱོང་བའི་ཡེ་ཤེས་བསམ་གྱིས་མི་ཁྱབ་བོ། །
en: Their wisdom in protecting beings is inconceivable.

source: སེམས་ཅན་འཛུདཔའི་ཡེ་ཤེས་བསམ་གྱིས་མི་ཁྱབ་བོ། །
en: Their wisdom in leading beings to understanding is inconceivable.

source: སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱེད་པའི་ཡེ་ཤེས་བསམ་གྱིས་མི་ཁྱབ་བོ།
en: Their wisdom in ripening beings is inconceivable.

source: སེམས་ཅན་འདུལ་བའི་ཡེ་ཤེས་བསམ་གྱིས་མི་ཁྱབ་བོ། །
en: Their wisdom in guiding beings is inconceivable.

source: སོང་རིགས་ཀྱི་བུ་དེ་ལ་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་དྲིས་ཤིག་ཅེས་ནས།
en: “Noble one, go and ask him about bodhisattva conduct!”

source: ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ཀྱིས་ལྷའི་ངག་མཉན་ཏེ། རྒྱལ་པོ་མེ་གང་ན་བ་དེར་སོང་སྟེ་ཕྱིན་ནས།
en: Sudhana, the head merchant’s son, listened to what the devas had said and approached the king.

source: རྒྱལ་པོ་མེའི་རྐང་པ་གཉིས་ལ་སྤྱི་བོས་ཕྱག་འཚལ་ཏེ། རྒྱལ་པོ་མེ་ལ་ལན་བརྒྱ་སྟོང་དུ་མར་གཡས་ཕྱོགས་སུ་བསྐོར་བ་བྱས་ནས་མདུན་དུ་འདུག་སྟེ། ཐལ་མོ་སྦྱར་ནས་འདི་སྐད་ཅེས་སྨྲས་སོ། །འཕགས་པ་བདག་གིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་ན། ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔས་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ལ་བསླབ་པར་བགྱི་བ་དང་།
en: When he had reached him, Sudhana bowed his head to the feet of King Anala, circumambulated him, keeping him to his right, many hundreds of thousands of times, and then sat before him and with palms together and said, “Ārya, I have developed the aspiration for the highest, complete enlightenment, but I do not know how bodhisattvas should train in bodhisattva conduct and in what way they should practice it.

source: ཇི་ལྟར་ནན་ཏན་དུ་བགྱི་བ་མ་འཚལ་ཏེ། འཕགས་པ་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ལ་གདམས་ངག་དང་རྗེས་སུ་བསྟན་པ་མཛད་དོ་ཞེས་བདག་གིས་ཐོས་ན།
en: “Ārya, I have heard that you give instruction and teachings to bodhisattvas!

source: འཕགས་པ་ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔས་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ལ་བསླབ་པར་བགྱི་བ་དང་། ཇི་ལྟར་ནན་ཏན་དུ་བགྱི་བ་བདག་ལ་བཀའ་སྩལ་དུ་གསོལ།
en: I pray that you explain to me how bodhisattvas should train in bodhisattva conduct and how they should practice it!”

source: དེ་ནས་རྒྱལ་པོ་མྱེས་རྒྱལ་པོའི་བྱ་བ་བྱས་ཏེ། སེང་གེའི་ཁྲི་ལས་ལངས་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ཀྱི་ལག་པ་གཡས་པ་ནས་བཟུང་སྟེ།
en: King Anala, having concluded his duties as a king, rose from his lion throne, and with his right hand he took hold of Sudhana, the head merchant’s son, and led him into the Tāladhvaja Palace.

source: རྒྱལ་པོའི་ཕོ་བྲང་ཏ་ལའི་རྒྱལ་མཚན་དུ་ཁྲིད་དོ། །དེ་མཐར་གྱིས་རང་གི་གནས་སུ་ཕྱིན་ནས། ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་བཙུན་མོའི་འཁོར་གྱི་ནང་དུ་ཁྲིད་དེ་ཁྲི་ལ་བཞག་ནས་འདི་སྐད་ཅེས་སྨྲས་སོ། །རིགས་ཀྱི་བུ་ངའི་ཁྱིམ་དང་ལོངས་སྤྱོད་ལ་ལྟོས་ཤེས་ནས།
en: When they had entered his residence, the king led Sudhana, the head merchant’s son, into the harem, where he sat upon a throne and said to Sudhana, “Noble one, look around at my home and possessions!”

source: དེས་བལྟས་ན་ཁྱིམ་དེ་རྒྱ་ཆེ་ཞིང་ཡངས་ལ་རིན་པོ་ཆེ་བདུན་གྱི་ར་བས་ཡོངས་སུ་བསྐོར་བ།
en: Sudhana looked around and saw that the building was huge and vast, encircled by walls made of the seven precious materials.

source: ནོར་བུ་རིན་པོ་ཆེ་སྣ་ཚོགས་ཀྱི་ཁང་པས་ཤིན་ཏུ་མཛེས་པར་བྱས་པ། རིན་པོ་ཆེའི་ཁང་པ་བརྩེགས་པ་བརྒྱ་སྟོང་དུ་མས་རབ་ཏུ་བརྒྱན་པ།
en: It was beautified by a variety of palaces of precious jewels, adorned with many hundreds of thousands of precious kūṭāgāras.

source: ནོར་བུ་རིན་པོ་ཆེ་བསམ་གྱིས་མི་ཁྱབ་པའི་འོད་ཤིན་ཏུ་འབར་བས་གཟི་བརྗིད་རབ་ཏུ་འབར་བར་བྱས་པ།
en: It was brilliantly bright with the shining light of countless precious jewels.

source: ནོར་བུ་རིན་པོ་ཆེ་སྣ་ཚོགས་ཀྱིས་རྣམ་པ་ཐ་དད་པ་རྣམ་པར་ཕྱེ་ཞིང་བྲིས་པས་རྣམ་པར་མཛེས་པར་བྱས་པ། མུ་ཏིག་དམར་པོའི་ཀ་བ་བཀྱེ་བ།
en: There were pillars made of red pearls that were beautified by arrangements of a shining variety of different precious jewels.

source: ནང་དུ་སེང་གེའི་ཁྲི་མུ་སར་གལ་བ་ལས་བྱས་པ། རིན་པོ་ཆེ་བརྒྱ་སྟོང་དུ་མས་རྣམ་པ་སྣ་ཚོགས་སུ་བརྒྱན་པ།
en: Inside was a beautifully constructed lion throne made of white coral that was adorned with many hundreds of thousands of jewels.

source: ཤིན་ཏུ་བཤམས་པ། ནོར་བུ་རིན་པོ་ཆེའི་སྒྲ་སྣང་བའི་སེང་གེའི་རྒྱལ་མཚན་ཤིན་ཏུ་བསྒྲེང་བ།
en: There were raised lion banners made of precious asteria jewels.

source: སྟེང་ནས་ནོར་བུ་རིན་པོ་ཆེ་རྣམ་པར་སྣང་བའི་བླ་རེ་བྲེས་པ།
en: Above the throne was a canopy of shining, precious jewels.

source: ཡིད་བཞིན་གྱི་ནོར་བུ་རིན་པོ་ཆེ་སྣ་ཚོགས་ཀྱི་དྲ་བས་ཀུན་ནས་ཡོག་པ།
en: The room was covered with nets of strings of various wish-fulfilling precious jewels.

source: ནོར་བུ་རིན་པོ་ཆེ་སྣ་ཚོགས་གྲངས་མྱེད་པས་རབ་ཏུ་བརྒྱན་པའི་བ་གམ་གྱི་རྒྱན་དང་ལྡན་པ།
en: It was adorned by an array of ornamental spires adorned by a countless variety of precious jewels.

source: ཨ་སྨ་གར་བྷ་ལས་བྱས་པའི་རྫིང་ཆུ་བསིལ་བས་གང་བ་དང་ལྡན་པ།
en: There were pools made from emeralds that were filled with cool water.

source: རིན་པོ་ཆེ་སྣ་ཚོགས་ཀྱི་ཤིང་གིས་འཁོར་བར་འདུག་པ་མཐོང་ངོ་། །དེའི་འཁོར་བུད་མྱེད་བཟང་ཞིང་མཛེས་ལ་བལྟ་ན་སྡུག་པ། ཁ་དོག་རྒྱས་པ།
en: It was encircled by trees made of various precious materials.

source: བཟང་བའི་ཕུལ་དུ་བྱ་བ་དང་ལྡན་པ། སྒྱུ་རྩལ་ཐམས་ཅད་ཀྱི་ཚུལ་ལ་མཁས་པ་སྔོན་དུ་ལྡང་བ། ཕྱི་ནས་ཉལ་བ་བྱམས་པའི་སེམས་དང་ལྡན་པ། ཅི་བསྒོ་བ་བཞིན་དུ་བྱེད་ཅིང་། ངག་ཉན་པ་བྱེ་བ་ཕྲག་བཅུ་ཡང་འཁོད་པར་མཐོང་ངོ་། །
en: Sudhana saw that the ten million women of the king’s entourage were beautiful, attractive, and pretty; had the most perfect, magnificent color; had mastered all skills; rose before him and slept after him; had loving minds; did whatever they were told to do; and were obedient.

source: དེ་ནས་རྒྱལ་པོ་མྱེས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །རིགས་ཀྱི་བུ་ཇི་སྙམ་དུ་སེམས།
en: Then King Anala asked Sudhana, the head merchant’s son, “Noble one, what do you think?

source: ཅིག་སྡིག་པ་བྱེད་པ་རྣམས་ལ་ལས་ཀྱི་རྣམ་པར་སྨིན་པ་མངོན་པར་གྲུབ་པ་འདི་ལྟ་བུ་ཡོད་དམ།
en: Is there this kind of ripening of karma for those who have committed bad actions?

source: ལུས་ཕུན་སུམ་ཚོགས་པ་འདི་ལྟ་བུ་ཡོད་དམ། འཁོར་ཕུན་སུམ་ཚོགས་པ་འདི་ལྟ་བུ་ཡོད་དམ།
en: Is there this kind of perfect body?

source: སྐྱིད་པ་ཆེན་པོ་ཕུན་སུམ་ཚོགས་པ་འདི་ལྟ་བུ་ཡོད་དམ།
en: Is there this kind of perfect great happiness?

source: དབང་ཕྱུག་དང་དབང་ཆེན་པོ་ཐོབ་པ་ཕུན་སུམ་ཚོགས་པ་འདི་ལྟ་བུ་ཡོད་དམ།
en: Is there this kind of perfect attainment of sovereignty and great power?”

source: སྨྲས་པ་འཕགས་པ་དེ་ལྟ་བུ་ནི་མ་མཆིས་སོ། །དེས་སྨྲས་པ།
en: Sudhana replied, “Ārya, there are no such things.”

source: རིགས་ཀྱི་བུ་ང་ནི་བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་པ། སྒྱུ་མའི་རྣམ་པ་ཐོབ་པ་སྟེ། རིགས་ཀྱི་བུ་ངའི་ཡུལ་ན་གནས་པའི་སེམས་ཅན་འདི་དག་ཀྱང་ཕལ་ཆེར་སྲོག་གཅོད་པ་བྱེད་པ། མ་བྱིན་པར་ལེན་པ། འདོད་པས་ལོག་པར་གཡེམ་པ། བརྫུན་དུ་སྨྲ་བ། ཕྲ་མ་ཅན་ཚིག་བརླང་བོར་སྨྲ་བ། བྱུང་རྒྱལ་དུ་བརྗོད་པ། ཆགས་སེམས་དང་ལྡན་པ། གནོད་སེམས་ཅན།
en: King Anala said, “Noble one, I have attained the bodhisattva liberation called the attainment of illusions.

source: ལོག་པར་ལྟ་བ། སྡིག་པའི་ལས་བྱེད་པ། ཁྲོ་ཞིང་གཏུམ་པ། བབ་རྒྱལ་ཅན། མི་དགེ་བའི་ལས་ཀྱི་བྱ་བ་སྣ་ཚོགས་དང་ལྡན་པ་དག་སྟེ།
en: Noble one, most of the inhabitants of my kingdom kill, steal, practice sexual misconduct, lie, slander, abuse, indulge in idle talk, are avaricious, are malicious, hold false views, commit bad actions, and are fierce, aggressive, and cruel, and they maintain a behavior consisting of all kinds of bad actions.

source: དེ་དག་ནི་རྣམ་པ་གཞན་གྱིས་སྡིག་པའི་སྤྱོད་པ་ལས་བཟློག་པ་དང་། དགག་པ་དང་། བསྟན་པར་མི་ནུས་ཏེ། དེ་ལྟར་རིགས་ཀྱི་བུ་ང་ནི་སེམས་ཅན་འདི་དག་གདུལ་བ་དང་།
en: “There is no other way to instruct them to turn away, to desist, from that sinful behavior.

source: ཡོངས་སུ་སྨིན་པར་བྱ་བ་དང་། ཤིན་ཏུ་དུལ་བར་བྱ་བ་དང་། ཕན་པ་ལ་དགོད་པར་བྱ་བའི་ཕྱིར། སྙིང་རྗེ་ཆེན་པོ་མདུན་དུ་བྱས་ཏེ། གསོད་པའི་གཤེད་མ་སྤྲུལ་པ་རྣམས་གསད་པའི་མྱིར་སྤྲུལ་པ་རྣམས་ལ།
en: “Noble one, in order to guide, ripen, control, and benefit these beings, motivated by great compassion I manifest the illusory images of executioners, through which I execute the illusory images of the condemned.

source: གསོད་དུ་གཟུང་པ་དང་། ཆད་པས་གཅོད་པའི་མི་སྤྲུལ་པ་རྣམས་མི་དགེ་བའི་ལས་ཀྱི་ལམ་ལ་སྤྱོད་པར་སྤྲུལ་པའི་མྱི་རྣམས་ལ་ཆད་པ་སྣ་ཚོགས་ཀྱིས་གཅོད་དུ་གཟུད་པ་དང་།
en: I make the illusions of those who punish and execute in various ways the illusions of those who have followed a path of bad actions.

source: རྐ་ལག་དང་སྣ་དང་རྣ་བ་དང་། ཡན་ལག་དང་ཉིང་ལག་དང་། མགོ་བཅད་པ་ལས་བྱུང་བའི་སྡུག་བསྔལ་མི་བཟད་པ་ཉམས་སུ་ཚོར་བར་གྱུར་བ་ལྟ་བུ་དག་ཀྱང་ཡོངས་སུ་སྟོན་པ་བྱེད་དེ།
en: I also emanate those who experience the unendurable sufferings of having their feet, hands, noses, ears, limbs, smaller parts, and heads cut off.

source: དེ་མཐོང་ནས་ངའི་ཁམས་ན་གནས་པའི་སེམས་ཅན་དེ་དག་ཉེས་པ་གཏོང་ཞིང་སྐྱོ་བའི་ཤུགས་ཐོབ་པར་འགྱུར་རོ། །འཇིགས་པ་སྐྱེ་ཞིང་བག་ཚ་བ་སྐྱེ་བར་འགྱུར་རོ། །
en: When the beings who live in my realm see that, they become distressed, afraid, and terrified.

source: དེ་དག་སྡིག་པའི་ལས་བྱེད་པ་རྣམས་གཏོང་ཞིང་བག་བྱེད་པར་འགྱུར་རོ། །
en: After that, they are careful to avoid committing bad actions.

source: རིགས་ཀྱི་བུ་དེ་ལྟར་ང་ནི་སེམས་ཅན་འདི་དག་ཐབས་དེས་ཉེས་པ་སྟོང་ཞིང་འཇིགས་པའི་སེམས་དང་ལྡན་པ་དང་། སྐྱོ་བའི་ཡིད་དང་ལྡན་པར་ཤེས་ནས། མི་དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་ལས་བཟློག་སྟེ། དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་དང་ལྡན་པར་བྱས་ནས་དགའ་ཞིང་བདེ་བའི་མཐར་ཕྱིན་པ། སྡུག་བསྔལ་ཐམས་ཅད་རྒྱུན་ཆད་པའི་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བདེ་བ་ལ་དགོད་པ་བྱེད་ཀྱི།
en: “Noble one, when in that way I have used that method and see that these beings are distressed, terrified, and alarmed, I then turn them away from the path of the ten bad actions, cause them to possess the path of the ten good actions, and establish them in the path to omniscience, which is the ultimate attainment of joy and happiness and the cessation of all suffering.

source: རིགས་ཀྱི་བུ་ང་ནི་ལུས་དང་ངག་གམ། ཡིད་ཀྱིས་ཀྱང་སེམས་ཅན་སུ་ལའང་ཅོ་མི་འདྲི། ཐོ་མི་འཚམ་མོ།
en: “Noble one, I do not cause harm to any being with my body, speech, or mind.

source: རིགས་ཀྱི་བུ་ང་ནི་ཕྱི་མའི་མཐའི་མནར་མྱེད་པའི་སྡུག་བསྔལ་གྱིས་བགྲིངས་ཤེས་པ་སྟེ། བྱོལ་སོང་གི་སྐྱེ་གནས་གླེན་པའི་ཁམས་སུ་གཏོགས་པ་ལས་ཀྱང་ཆུང་ངུ་ན། རྩྭའི་རྩེ་མོས་བལྟ་བའི་སྲོག་ཆགས་ཕྲེའུ་འགའ་ལ་ཡང་སེམས་བསྐྱེད་པ་གཅིག་ཙམ་དུ་ཡང་སྡུག་བསྔལ་བར་བྱ་བར་མྱི་དགའ་ན། ཞིང་དུ་གྱུར་ཅིང་དགེ་བའི་ལས་ཀྱི་ལམ་བསྐྱེད་པར་ནུས་པའི་མི་ལྟ་ཞིག་ཅི་སྨོས།
en: “Noble one, I would wander in the most extreme suffering of the Avīci hell, but I would not even once have arise in my mind the wish to cause harm to even the smallest being, a minute insect seen on the tip of a blade of grass, existing in the realm of stupidity, which is rebirth as an animal, let alone to a human being in my realm, who has the ability to develop the path of good actions.

source: རིགས་ཀྱི་བུ་ང་ནི་རྨི་ལམ་ན་ཡང་མི་དགེ་བའི་ཆོས་ཡོངས་སུ་རྒྱུ་བ་མྱི་བསྐྱེད་ན། ཆེད་དུ་བསམས་ཏེ་ལྟ་སྨོས་རེ་སྐན།
en: “Noble one, I do not generate the qualities of a bad action in my dreams, let alone deliberately.

source: རིགས་ཀྱི་བུ་དེ་ལྟར་ངས་ནི་བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་པ་སྒྱུ་མའི་རྣམ་པ་འདི་ཤེས་པར་ཟད་ན། ངས་ནི་བྱང་ཆུབ་སེམས་དཔའ་མི་སྐྱེ་བའི་ཆོས་ཀྱི་བཟོད་པ་ཐོབ་པ། སྲིད་པ་དང་ལམ་གྱི་རྒྱུད་ཐམས་ཅད་སྒྱུ་མའི་རྣམ་པ་ཁོང་དུ་ཆུད་པ་སྤྲུལ་པ་ལྟ་བུའི་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པས་བྱུང་བ།
en: “Noble one, I know only this bodhisattva liberation called the attainment of illusions.

source: གཟུགས་བརྙན་ལྟ་བུའི་འཇིག་རྟེན་ཐམས་ཅད་རྣམ་པར་རིག་པ། རྨི་ལམ་ལྟ་བུའི་ཆོས་ཉིད་ཁོང་དུ་ཆུད་པ། ཐོགས་པ་མེད་པའི་སྒོའི་ཆོས་ཀྱི་དབྱིངས་ཀྱི་ཚུལ་ལ་རྗེས་སུ་ཞུགས་པ། མྱིག་འཕྲུལ་ལྟ་བུའི་སྤྱོད་པའི་དྲ་བ་རྟོགས་པར་གྱུར་པ། ཡེ་ཤེས་བསྒྲིབས་པ་མེད་པའི་སྤྱོད་ཡུལ་གྱི་ཡུལ་དང་ལྡན་པ། ཀུན་ཏུ་ཡང་དག་པར་གཞོལ་བའི་ཏིང་ངེ་འཛིན་གྱི་ལམ་གྱིས་བྱུང་བ། ཀློང་ཀུན་ཏུ་འཁྱིལ་པའི་རྒྱུད་ཀྱི་གཟུགས་ལ་དབང་བསྒྱུར་བ། སངས་རྒྱས་ཀྱི་སྤྱོད་ཡུལ་གྱི་ཡུལ་ཁོང་དུ་ཆུད་པ་རྣམས་ཀྱི་སྤྱོད་ཡུལ་ཤེས་པའམ།
en: How could I know the conduct or describe the qualities of bodhisattvas who have attained the patience of the birthlessness of phenomena, who have realized that all states of existence are illusions, who have given rise to the bodhisattva conduct that is like an illusion, who know that all worlds are like reflections, who have realized that the nature of phenomena is like a dream, who follow the way of the unimpeded gateway to the realm of the Dharma, who have understood that the net of conduct is like a magical illusion, who have the scope of the range of unobscured wisdom, who have set forth on the path of unobscured samādhi, who have gained the power of retention that has an infinite capacity, and who comprehend the scope of the range of activity of the buddhas?

source: ཡོན་ཏན་བརྗོད་པར་ནུས་རེ་སྐན། །
en: “Depart, noble one.

source: སོང་རིགས་ཀྱི་བུ་ལྷོ་ཕྱོགས་ཀྱི་རྒྱུད་འདི་ཉིད་ན། གྲོང་ཁྱེར་འོད་བཟང་པོ་ཞེས་བྱ་བ་ཡོད་དེ།
en: In this southern region there is a city called Suprabha.

source: དེ་ན་རྒྱལ་པོ་འོད་ཆེན་པོ་ཞེས་བྱ་བ་འདུག་གིས།
en: There dwells a king by the name of Mahāprabha.

source: དེའི་གན་དུ་སོང་ལ་ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔས་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པོ་ལ་བསླབ་པར་བྱ་བ་དང་།
en: Go to him and ask him, ‘How should a bodhisattva train in bodhisattva conduct?

source: དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ཀྱིས་རྒྱལ་པོ་མྱེའི་རྐང་པ་གཉིས་ལ་སྤྱི་བོས་ཕྱག་འཚལ་ནས། རྒྱལ་པོ་མེ་ལ་ལན་བརྒྱ་སྟོང་དུ་མར་གཡས་ཕྱོགས་སུ་བསྐོར་བ་བྱས་ཏེ། ཡང་དང་ཡང་བལྟས་ནས་རྒྱལ་པོ་མེའི་དྲུང་ནས་སོང་ངོ་། །
en: Then Sudhana, the head merchant’s son, bowed his head to the feet of King Anala, circumambulated King Anala many hundreds of thousands of times, keeping him to his right, and, looking back again and again, departed from King Anala.

source: དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ཡེ་ཤེས་སྒྱུ་མ་དེ་རྗེས་སུ་དྲན་པར་བྱེད་ཅིང་།
en: Mahāprabha Chapter 21 Sudhana, the head merchant’s son, remembered that illusion of wisdom.

source: བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་པ། སྒྱུ་མའི་རྣམ་པ་དེ་ལ་བསམ་པ་དང་།
en: He contemplated the bodhisattva’s liberation that had the form of illusion.

source: ཆོས་ཉིད་སྒྱུ་མའི་རྣམ་པ་དེ་ལ་རབ་ཏུ་བརྟག་པ་དང་།
en: He examined the illusory aspect of the nature of phenomena.

source: ལས་ཀྱི་སྒྱུ་མ་མཉམ་པ་དེ་ཁོང་དུ་ཆུད་པར་བྱ་བ་དང་།
en: He comprehended the equality of the illusions of actions.

source: ཆོས་ཀྱི་སྒྱུ་མ་མཉམ་པ་དེ་ལ་རྗེས་སུ་བསམ་པ་དང་།
en: He reflected on the equality of the illusions of phenomena.

source: ཆོས་ཀྱིས་ཡོངས་སུ་སྨིན་པར་བྱ་བའི་སྤྲུལ་པ་མཉམ་པ་དེ་ཁོང་དུ་ཆུད་པར་བྱ་བ་དང་།
en: He comprehended the equality of the emanations that are ripened by the Dharma.

source: ཡེ་ཤེས་ལས་བྱུང་བའི་སྣང་བ་བསམ་གྱིས་མི་ཁྱབ་པ་དེའི་རྗེས་སུ་འབྲང་བར་བྱ་བ་དང་།
en: He followed the inconceivable appearances that arise from wisdom.

source: སྨོན་ལམ་གྱི་སྒྱུ་མའི་རྣམ་པ་མཐའ་ཡས་པ་མངོན་པར་བསྒྲུབ་པ་དེ། མངོན་པར་བསྒྲུབ་པར་བྱ་བ་དང་།
en: He accomplished the accomplishment of the illusions of infinite prayer.

source: སྤྱོད་པ་སྤྲུལ་པའི་ཆོས་ཉིད་ཆགས་པ་མྱེད་པ་དེ་རྣམ་པར་སྦྱོང་བར་བྱ་བ་དང་།
en: He purified the unimpeded conduct that has the true nature of an illusory manifestation.

source: དུས་གསུམ་གྱི་སྒྱུ་མའི་རྣམ་པའི་མཚན་ཉིད་དེ་ཡང་རྣམ་པར་དབྱེ་བར་བྱེད་ཅིང་། མཐར་གྱིས་ཡུལ་ནས་ཡུལ་དུ་དྲི་བ་དང་། ཀུན་ཏུ་བཙལ་བ་དང་། རྗེས་སུ་རྣམ་པར་ལྟ་བུ་བྱེད་ཅིང་། ཕྱོགས་དང་ཕྱོགས་མཚམས་དང་ལམ་དང་། སྨན་ལྗོངས་དང་།
en: He analyzed the three times as having the characteristics of being composed of illusions.

source: ཐང་དང་། ཐག་ཐུག་དང་། ཁལ་ཁོལ་དང་། རི་དང་རི་སུལ་དང་། གྲོང་དང་གྲོང་ཁྱེར་དང་།
en: In one land after another, he questioned, searched, and looked around, seeking without weariness of the mind or exhaustion of the body throughout all the main and intermediate directions, roads, valleys, and plains, even and uneven ground, wet lands and dry lands, mountains and caves, villages and towns, markets, lands, kingdoms, and capitals.

source: གྲོང་རྡལ་དང་། ལྗོངས་དང་ཁམས་དང་། རྒྱལ་པོའི་གནས་ཐམས་ཅད་དུ་ཡོངས་སུ་སྐྱོ་བ་མྱེད་པའི་སེམས་དང་ལུས་ལ་དུ་བ་མེད་པར་ཚོལ་ཚོལ་ཏེ། གྲོང་ཁྱེར་ཆེན་པོ་འོད་བཟང་པོའི་ཉེན་ཀོར་ཞིག་ཏུ་ཕྱིན་པ་ན། རྒྱལ་པོ་འོད་ཆེན་པོ་གང་ན་བཞུགས་ཤེས་དྲིས་ན།
en: He reached the vicinity of the city of Suprabha and asked, “Where is King Mahāprabha?”

source: དེ་ལ་འགྲོ་བ་མང་པོས་བསྟན་པ། རིགས་ཀྱི་བུ་འདི་རེ་འདི་ནི་གྲོང་ཁྱེར་འོད་བཟང་པོ་ཞེས་བྱ་བ་ཡིན་ཏེ།
en: Many people told him, “Noble one, that over there is the city named Suprabha.

source: འདི་ན་རྒྱལ་པོ་འོད་ཆེན་པོ་བཞུགས་སོ་ཞེས་ནས།
en: King Mahāprabha lives there.”

source: དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་གྲོང་ཁྱེར་ཆེན་པོ་འོད་བཟང་པོ་གང་ན་བ་དེར་ཕྱིན་ནས། གྲོང་ཁྱེར་ཆེན་པོ་འོད་བཟང་པོ་མཐོང་ངོ་། །
en: Then Sudhana, the head merchant’s son, approached the city of Suprabha and saw the great city of Suprabha.

source: མཐོང་ནས་ཀྱང་དགའ་རངས་ཏེ། མགུ་ཞིང་ཉམས་བདེ་ལ་ཚིམ་ཞིང་ཡིད་བདེ་བ་སྐྱེས་ནས། འདི་སྙམ་དུ་བསམས་སོ། །
en: Seeing it, he was overjoyed, pleased, content, and happy.

source: འདི་ན་བདག་གི་དགེ་བའི་བཤེས་གཉེན་བཞུགས་པ་ལྟ་སྟེ།
en: He thought, “I am looking at the place where my kalyāṇamitra lives.

source: དེ་རིང་ནི་དགེ་བའི་བཤེས་གཉེན་དེ་ཡང་མཐོང་བར་འགྱུར་རོ། །དེ་ལས་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ཡང་ཐོས་པར་འགྱུར་རོ། །
en: Today I will see the kalyāṇamitra.

source: བྱང་ཆུབ་སེམས་དཔའི་འབྱུང་བའི་སྒོ་དང་། བྱང་ཆུབ་སེམས་དཔའི་ཆོས་ཉིད་བསམ་གྱིས་མི་ཁྱབ་པ་དང་། བྱང་ཆུབ་སེམས་དཔའི་ཡོན་ཏན་བསམ་གྱིས་མི་ཁྱབ་པ་དང་། བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་ཡུལ་བསམ་གྱིས་མི་ཁྱབ་པ་དང་། བྱང་ཆུབ་སེམས་དཔའི་ཁྱུ་མཆོག་གི་མཐུ་ཕྱུང་བ་བསམ་གྱིས་མི་ཁྱབ་པ་དང་། བྱང་ཆུབ་སེམས་དཔའི་ཏིང་ངེ་འཛིན་ལ་རྣམ་པར་སྤྱོད་པ་བསམ་གྱིས་མི་ཁྱབ་པ་དང་། བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་པས་རྣམ་པར་རོལ་པ་བསམ་གྱིས་མི་ཁྱབ་པ་དང་།
en: I will hear from him the bodhisattva conduct, and I will hear from him the inconceivable gateways through which the bodhisattva sets forth, the inconceivable true nature of a bodhisattva, the inconceivable qualities of a bodhisattva, the inconceivable range of activity of a bodhisattva, the inconceivable powerful supremacy of a bodhisattva, the inconceivable samādhis practiced by a bodhisattva, the inconceivable liberations enjoyed by a bodhisattva, and the inconceivable pure fulfillment of the undertakings of a bodhisattva.”

source: བྱང་ཆུབ་སེམས་དཔའི་བརྩམས་པ་ཆེན་པོ་མཐར་དབྱུང་བ་རྣམ་པར་དག་པ་བསམ་གྱིས་མི་ཁྱབ་པ་འང་ཐོས་པར་འགྱུར་རོ་ཞེས་དེ་ལྟར་བསམ་པ་ཡིད་ལ་བྱེད་ཅིང་གྲོང་ཁྱེར་ཆེན་པོ་འོད་བཟང་པོ་གང་ན་བ་དེར་སོང་སྟེ་ཕྱིན་ནས་གྲོང་ཁྱེར་ཆེན་པོ་འོད་བཟང་པོ་དེ་ལ་བལྟས་ན། གསེར་དང་དངུལ་དང་བཻཌཱུརྱ་དང་། ཤེལ་དང་མུ་ཏིག་དམར་པོ་དང་། ཨ་སྨ་གར་བྷ་དང་། མུ་ས་ར་གལ་པ་དང་།
en: Concentrating on those thoughts, Sudhana approached the city of Suprabha, and having arrived he looked at the city of Suprabha.
